#Человек работает в компании с накоплением отпускных дней 
#и автоматическим индексированием зарплаты: каждый месяц она увеличивается на  
# 100 рублей, а за каждые две недели появляется один день отпуска. 
# Отпускные рассчитываются как зарплата на конец предыдущего месяца.
# # Человек вводит дату поступления на работу. Вывести количество дней отпуска 
# сумму отпускных, предполагая, что он ещё ни разу не брал отпуск.
moth = 100
d = 2
#work=input('когда вы начали работпть? ')
m = input('ведите месяц поступления? (в цифрах)')
zar = input('какая у  вас зарплата?')
tu = 10

